package mustLv1Kiosk;

/**
 * lv.1 기본적인 키오스크를 프로그래밍 해보자.
 * - 입력 처리와 간단한 흐름 제어
 * - Scanner 활용법, 조건문, 반복문을 재확인하며 입역 데이터를 처리하는 방법 강화
 */
public class Main {
    public static void main(String[] args) {
        // 스캐너 선언

        // 주문 반복문(무한)

            // 식당 입장 _ 키오스크 안내문 ~~
            // 0. 종료
            // 숫자 입력
            // 0 누르면 주문 전체 종료

                // 반복문 (카테고리 선택이 유효하다면)
                // 카테고리_메뉴 종류
                // 1, 햄버거 / 2. 음료 / 3. 디저트 / 0. 뒤로가기
                // 숫자 입력 (1,2,3)
                // 0 누를시 키오스크 안내문 으로 복귀

                    // 반복문 (메뉴 선택이 유효하다면)
                    // 선택한 카테고리 상세메뉴 종류
                    // ..... 여러가지 메뉴 끝에 0. 뒤로가기 안내
                    // 숫자 선택 (1,2,3,4....)
                    // 0 누를시 카테고리 메뉴로 복귀

            // 최종 주문 완료 안내
            // 다른 메뉴 하시겠습니까? (1.  )
            // 최종 선택한 메뉴들 출력

            // 주문 프로그램 종료 안내

        // 주문 반복문 구간



    }
}
